# US - Baby Names

### Introduction:

In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this US_Baby_Names_right.csv

In [2]:
baby_names = pd.read_csv("data/US_Baby_Names_right.csv")

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

### Step 4. See the first 10 entries

In [4]:
baby_names[:10]

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
baby_names = baby_names.drop(['Unnamed: 0', 'Id'], axis=1)

In [6]:
baby_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [7]:
groupedByGender = baby_names['Gender'].value_counts()

idx_list = groupedByGender.index.tolist()
female_idx = idx_list[0]
male_idx = idx_list[1]

total_females = groupedByGender[female_idx]
total_males = groupedByGender[male_idx]

if total_females > total_males:
    print("More {}({}) than {}({})."
          .format(female_idx, total_females, male_idx, total_males))
elif total_females == total_males:
    print("Equal amount of {} and {} ({})".format(female_idx, male_idx, total_females))
else:
    print("More {}({}) than {}({})."
          .format(male_idx, total_males, female_idx, total_females))

More F(558846) than M(457549).

### Step 7. Group the dataset by name and assign to names

In [12]:
names_aux = baby_names.groupby(["Name"])
names_data = []
ocurrences = []
for name in names_aux.groups.keys():
    names_data.append(name)
    ocurrences.append(names_aux.get_group(name).count()[0])

data = (names_data, ocurrences)
aux = pd.DataFrame(data)
names = aux.T
names.columns = ['Name', 'Ocurrences']
names["Ocurrences"] = pd.to_numeric(names["Ocurrences"])
names

          Name  Ocurrences
0        Aaban           2
1        Aadan           4
2      Aadarsh           1
3        Aaden         196
4       Aadhav           1
...        ...         ...
17627     Zyra           7
17628    Zyrah           2
17629    Zyren           1
17630    Zyria          10
17631   Zyriah           9

[17632 rows x 2 columns]

### Step 8. How many different names exist in the dataset?

In [13]:
print(len(names))

17632

### Step 9. What is the name with most occurrences?

In [14]:
idx = names.Ocurrences.idxmax()
name = names.iloc[idx].Name
ocurrences = names.iloc[idx].Ocurrences
print("The name {} is the most popular name with a total of {} occurrences."
      .format(name, ocurrences))

The name Riley is the most popular name with a total of 1112 occurrences.

### Step 10. How many different names have the least occurrences?

In [15]:
least_ocurrences = names[names.Ocurrences == 1]
print("A total of {} names have only been used once.".format(len(least_ocurrences)))

A total of 3682 names have only been used once.

### Step 11. What is the median name occurrence?

In [16]:
names.Ocurrences.median()

8.0

### Step 12. What is the standard deviation of names?

In [17]:
names.Ocurrences.std()

122.02996350814125

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [18]:
names.describe()

         Ocurrences
count  17632.000000
mean      57.644907
std      122.029964
min        1.000000
25%        2.000000
50%        8.000000
75%       39.000000
max     1112.000000